//Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
int number = Convert.ToInt32(Console.ReadLine());
if ((number%2) == 0 )
    System.Console.WriteLine("Da");
else
    System.Console.WriteLine("net");